In [18]:
import sqlite3

conn = sqlite3.connect('sqlite_db_pythonsqlite.db')

In [19]:
import pandas as pd

In [23]:
query = 'SELECT * FROM Facilities'
df = pd.read_sql_query(query,conn)
df.head()

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000,200
1,1,Tennis Court 2,5.0,25.0,8000,200
2,2,Badminton Court,0.0,15.5,4000,50
3,3,Table Tennis,0.0,5.0,320,10
4,4,Massage Room 1,9.9,80.0,4000,3000

In [ ]:
#Produce a list of facilities with a total revenue less than 1000.
#The output of facility name and total revenue, sorted by revenue. Remember
#that there's a different cost for guests and members!

In [30]:
query10 = 'SELECT Facilities.name, SUM(CASE WHEN Bookings.memid = 0 THEN Bookings.slots*Facilities.guestcost ELSE Bookings.slots * Facilities.membercost END) AS total_revenue FROM Facilities JOIN Bookings ON Facilities.facid = Bookings.facid GROUP BY Facilities.name HAVING total_revenue < 1000 ORDER BY total_revenue;'

df10 = pd.read_sql_query(query10, conn)

In [40]:
df10.head()

       member_name recommender_name
0  Bader, Florence  Stibbons,Ponder
1      Baker, Anne  Stibbons,Ponder
2   Baker, Timothy   Farrell,Jemima
3      Boothe, Tim       Rownam,Tim
4  Butters, Gerald     Smith,Darren

In [38]:
#Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order

In [35]:
query_M = 'SELECT Member1.surname ||", "|| Member1.firstname AS member_name, Member2.surname ||","|| Member2.firstname AS recommender_name FROM Members Member1 LEFT JOIN Members Member2 ON Member1.recommendedby = Member2.memid ORDER BY Member1.surname, Member1.firstname'

In [36]:
df_M = pd.read_sql_query(query_M, conn)

In [37]:
df_M.head()

       member_name recommender_name
0  Bader, Florence  Stibbons,Ponder
1      Baker, Anne  Stibbons,Ponder
2   Baker, Timothy   Farrell,Jemima
3      Boothe, Tim       Rownam,Tim
4  Butters, Gerald     Smith,Darren

In [39]:
#Find the facilities with their usage by member, but not guests

In [42]:
query_U = 'SELECT Facilities.name AS facility_name, COUNT(Bookings.bookid) AS member_usage FROM Facilities JOIN Bookings ON Facilities.facid = Bookings.facid WHERE Bookings.memid != 0 GROUP BY Facilities.name ORDER BY member_usage DESC;'

In [43]:
df_U = pd.read_sql_query(query_U, conn)

In [44]:
df_U.head()

     facility_name  member_usage
0       Pool Table           783
1    Snooker Table           421
2   Massage Room 1           421
3     Table Tennis           385
4  Badminton Court           344

In [45]:
#Find the facilities usage by month, but not guests

In [58]:
query_USE = 'SELECT Facilities.name AS facility_name, strftime("%Y-%m", Bookings.starttime) AS month, COUNT(Bookings.bookid) AS usage_count FROM Facilities JOIN Bookings ON Facilities.facid = Bookings.facid WHERE Bookings.memid != 0 GROUP BY Facilities.name ORDER BY month;'

In [59]:
df_USE = pd.read_sql_query(query_USE, conn)

In [60]:
df_USE.head()

     facility_name    month  usage_count
0  Badminton Court  2012-07          344
1   Massage Room 1  2012-07          421
2   Massage Room 2  2012-07           27
3       Pool Table  2012-07          783
4    Snooker Table  2012-07          421